[
  {
    "path": "posts/metrics-search-ranking/",
    "title": "Measuring Ranking",
    "description": "The metrics for ranking through a code-first explanation.",
    "author": [
      {
        "name": "Nikhil Kasukurthi",
        "url": {}
      }
    ],
    "date": "2024-06-15",
    "categories": [],
    "contents": "\n\nIntroduction\nWhen a query is fired on Google, the ordering of these results is a key factor.\nThis is known as ranking.\nSimilarly, in case of uber, showing the relevant ride type (Normal, SUV, Lux) is key for customer conversion.\nAnd in case of e-commerce search engine like that of Amazon, ranking the results on every page is critical, for better conversion.\n\nIn social media networks like Twitter or Instagram, posts needs to be ranked to decide the order in which they are shown.\nIntuitively, as illustrated in /figure the way to evaluate ranking systems would be to rank the item user clicks on first as the most relevant in case of e-commerce or else search engines.\nDrawing parallels, in social media networks, a post that user interacts with, through likes or clicks, could be considered as most relevant and thus ranked higher.\nIn this post, the objective is to understand the methods to evaluate the ranking of results.\nIt’s a secondary step to retrial.\n\n\n\n",
    "preview": {},
    "last_modified": "2024-06-15T11:00:11+05:30",
    "input_file": "metrics_search_ranking.knit.md"
  },
  {
    "path": "posts/introduction/",
    "title": "Introduction to wawn.io",
    "description": "When and When Not",
    "author": [
      {
        "name": "Nikhil Kasukurthi",
        "url": {}
      }
    ],
    "date": "2021-05-31",
    "categories": [],
    "contents": "\nWhen and When Not\nMore often than not, there are multiple ways to solve a problem. And most developers and data scientists learn on the job, for the job. This means that at times, we might be learning part of a whole, that is pertinent to task at hand.\nAlthough this approach is quick and gets the job done, sometimes you can’t help but wonder, what’s the right way of doing this? or what are the alternative ways of doing this.\nhttps://wawn.io is just the place for that.\nMost experienced developers almost always say the largest learning they had are through their colleagues or friends. https://wawn.io is a place to formalize that knowledge as well. The long term plan on different types of posts is something like this.\nDifferent ways of doing a similar thing.\nLearning the basics, with directions to the resources.\nIn depth surveys of a method, exploring the genesis to the most recent advances of a method.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-31T10:41:30+05:30",
    "input_file": {}
  }
]
